require 'socket'
sfdclaptop = Socket.gethostname =~ /^lincolnsto-ltm/

cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/fonts'

brew 'readline'
brew 'bash-completion'
brew 'emacs', args: ['with-cocoa', 'with-modules']
cask 'google-chrome'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask '1Password' unless sfdclaptop
cask 'Arq' unless sfdclaptop
cask 'google-drive'
cask 'iterm2'
brew 'mas'
brew 'rbenv'
brew 'go'
brew 'mercurial'
brew 'protobuf'
brew 'lastpass-cli'
cask 'lastpass'
mas 'Lastpass', id: 926036361
brew 'git'
brew 'the_silver_searcher'
cask ENV['HOME']+'/.setup/brews/font-meslo-lg.rb'
mas 'Monodraw', id: 920404675
mas 'Monosnap', id: 540348655
cask 'gpgtools'
cask 'Sonos' unless sfdclaptop
cask 'docker'
cask 'Slack'
cask 'Things'
mas 'Wunderlist', id: 410628904
cask 'Shimo' unless sfdclaptop
mas 'Acorn 4', id: 634108295
mas 'GIF Brewery 3', id: 1081413713 unless sfdclaptop
cask 'irccloud'
cask 'quip'
brew 'heroku'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vagrant'
brew 'terraform'
brew 'kubernetes-cli'
brew 'ipcalc'
brew 'ansible'
brew 'awscli'
brew 'bazel'
brew 'jq'
brew 'mtr'
brew 'wget'
brew 'tmux'
brew 'vcprompt'
