cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/fonts'

brew 'emacs', args: ['with-cocoa', 'with-modules']
cask 'google-chrome'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask '1Password'
cask 'Arq'
cask 'google-drive'
cask 'iterm2'
brew 'mas'
brew 'rbenv'
brew 'go'
brew 'protobuf'
brew 'lastpass-cli'
brew 'git'
brew 'the_silver_searcher'
cask ENV['HOME']+'/.setup/brews/font-meslo-lg.rb'
mas 'Monodraw', id: 920404675
mas 'Monosnap', id: 540348655
cask 'gpgtools'
cask 'Sonos'
cask 'docker'
cask 'Slack'
cask 'Things'
mas 'Wunderlist', id: 410628904
cask 'Shimo'
mas 'Acorn 4', id: 634108295
mas 'GIF Brewery 3', id: 1081413713
cask 'irccloud'
cask 'quip'
